Revit 2027 API
PipePlumbingFixtureFlowData.FlowConfiguration Property
 The flow configuration mode of the pipe.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PipeFlowConfigurationType FlowConfiguration { get; }
Public ReadOnly Property FlowConfiguration As PipeFlowConfigurationType
	Get
public:
property PipeFlowConfigurationType FlowConfiguration {
	PipeFlowConfigurationType get ();
}
member FlowConfiguration : PipeFlowConfigurationType with get
Property Value
PipeFlowConfigurationType
See Also
Reference
PipePlumbingFixtureFlowData Class
Autodesk.Revit.DB.Plumbing Namespace